anachrocomputer/STM32_SSD1351/spi_oled.c
void fillRect(const int x1, const int y1, const int x2, const int y2, const int ec, const int fc)
{
    int y;

    for (y = y1; y <= y2; y++)
        if (fc == 0)
            clrHline(x1, x2, y);
        else if (fc == 1)
            setHline(x1, x2, y);

    if (ec == 1)
    {
        setHline(x1, x2, y1);
        setVline(x2, y1, y2);
        setHline(x1, x2, y2);
        setVline(x1, y1, y2);
    }
    else if (ec == 0)
    {
        clrHline(x1, x2, y1);
        clrVline(x2, y1, y2);
        clrHline(x1, x2, y2);
        clrVline(x1, y1, y2);
    }
}

#define  WD  (15)    // Width of digit (X-coord of rightmost pixel of segments 'b' and 'c')
#define  GY  (13)    // Y-coord of 'g' segment of Panaplex (slightly above half-way)

void drawLed(const int x0, int x, int y)
{
   x *= 4;
   y *= 4;
   
   x += x0;
   y += 3;
   
   setHline(x, x + 2, y + 0);
   setHline(x, x + 2, y + 1);
   setHline(x, x + 2, y + 2);
}


void drawSegA(const int x, const int style)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setHline(x, x + WD, 0);
      setHline(x, x + WD, 1);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 1, 0);
      drawLed(x, 2, 0);
      break;
   case LED_BAR_STYLE:
      setHline(x + 3, x + WD - 3, 0);
      setHline(x + 3, x + WD - 3, 1);
      setHline(x + 3, x + WD - 3, 2);
      break;
   case VFD_STYLE:
      setHline(x + 1, x + WD - 1, 0);
      setHline(x + 2, x + WD - 2, 1);
      setHline(x + 3, x + WD - 3, 2);
      break;
   }
}


void drawSegB(const int x, const int style)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setVline(x + WD,     0, GY);
      setVline(x + WD - 1, 0, GY);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 3, 1);
      drawLed(x, 3, 2);
      break;
   case LED_BAR_STYLE:
      setVline(x + WD,     3, 14);
      setVline(x + WD - 1, 3, 14);
      setVline(x + WD - 2, 3, 14);
      break;
   case VFD_STYLE:
      setVline(x + WD,     1, 13);
      setVline(x + WD - 1, 2, 14);
      setVline(x + WD - 2, 3, 13);
      break;
   }
}


void drawSegC(const int x, const int style)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setVline(x + WD,     GY, 31);
      setVline(x + WD - 1, GY, 31);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 3, 4);
      drawLed(x, 3, 5);
      break;
   case LED_BAR_STYLE:
      setVline(x + WD,     18, 28);
      setVline(x + WD - 1, 18, 28);
      setVline(x + WD - 2, 18, 28);
      break;
   case VFD_STYLE:
      setVline(x + WD,     19, 30);
      setVline(x + WD - 1, 18, 29);
      setVline(x + WD - 2, 19, 28);
      break;
   }
}


void drawSegD(const int x, const int style)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setHline(x, x + WD, 31);
      setHline(x, x + WD, 30);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 1, 6);
      drawLed(x, 2, 6);
      break;
   case LED_BAR_STYLE:
      setHline(x + 3, x + WD - 3, 31);
      setHline(x + 3, x + WD - 3, 30);
      setHline(x + 3, x + WD - 3, 29);
      break;
   case VFD_STYLE:
      setHline(x + 1, x + WD - 1, 31);
      setHline(x + 2, x + WD - 2, 30);
      setHline(x + 3, x + WD - 3, 29);
      break;
   }
}


void drawSegE(const int x, const int style)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setVline(x + 0, GY, 31);
      setVline(x + 1, GY, 31);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 0, 4);
      drawLed(x, 0, 5);
      break;
   case LED_BAR_STYLE:
      setVline(x + 0, 18, 28);
      setVline(x + 1, 18, 28);
      setVline(x + 2, 18, 28);
      break;
   case VFD_STYLE:
      setVline(x + 0, 17, 30);
      setVline(x + 1, 18, 29);
      setVline(x + 2, 19, 28);
      break;
   }
}


void drawSegF(const int x, const int style)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setVline(x + 0, 0, GY);
      setVline(x + 1, 0, GY);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 0, 1);
      drawLed(x, 0, 2);
      break;
   case LED_BAR_STYLE:
      setVline(x + 0, 3, 14);
      setVline(x + 1, 3, 14);
      setVline(x + 2, 3, 14);
      break;
   case VFD_STYLE:
      setVline(x + 0, 1, 15);
      setVline(x + 1, 2, 14);
      setVline(x + 2, 3, 13);
      break;
   }
}


void drawSegG(const int x, const int style)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setHline(x, x + WD, GY);
      setHline(x, x + WD, GY + 1);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 1, 3);
      drawLed(x, 2, 3);
      break;
   case LED_BAR_STYLE:
      setHline(x + 3, x + WD - 3, 15);
      setHline(x + 3, x + WD - 3, 16);
      setHline(x + 3, x + WD - 3, 17);
      break;
   case VFD_STYLE:
      setHline(x + 2, x + WD - 2, 15);
      setHline(x + 1, x + WD - 1, 16);
      setHline(x + 2, x + WD - 2, 17);
      break;
   }
}


void drawSegH(const int x, const int style)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setHline(x + WD, x + WD + 3, GY);
      setHline(x + WD, x + WD + 3, GY + 1);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 4, 3);
      break;
   case LED_BAR_STYLE:
      setHline(x + WD + 1, x + WD + 3, 15);
      setHline(x + WD + 1, x + WD + 3, 16);
      setHline(x + WD + 1, x + WD + 3, 17);
      break;
   case VFD_STYLE:
      setHline(x + WD,     x + WD + 3, 15);
      setHline(x + WD - 1, x + WD + 3, 16);
      setHline(x + WD,     x + WD + 3, 17);
      break;
   }
}


void drawSegI(const int x, const int style)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 0, 0);
      break;
   }
}


void drawSegJ(const int x, const int style)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 3, 0);
      break;
   }
}


void drawSegK(const int x, const int style)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 3, 3);
      break;
   }
}


void drawSegL(const int x, const int style)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 3, 6);
      break;
   }
}


void drawSegM(const int x, const int style)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 0, 6);
      break;
   }
}


void drawSegN(const int x, const int style)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 0, 3);
      break;
   }
}


