anachrocomputer/STM32_SSD1351/spi_oled.c
void drawSegDP(const int x, const int style)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setHline(x + WD + 2, x + WD + 4, 29);
      setHline(x + WD + 2, x + WD + 4, 30);
      setHline(x + WD + 2, x + WD + 4, 31);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 4, 6);
      break;
   case LED_BAR_STYLE:
   case VFD_STYLE:
      setHline(x + WD + 2, x + WD + 4, 29);
      setHline(x + WD + 2, x + WD + 4, 30);
      setHline(x + WD + 2, x + WD + 4, 31);
      break;
   }
}


void drawSegCN(const int x, const int style)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setHline(x + WD + 2, x + WD + 3,  9);
      setHline(x + WD + 2, x + WD + 3, 10);
      setHline(x + WD + 2, x + WD + 3, 17);
      setHline(x + WD + 2, x + WD + 3, 18);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 4, 2);
      drawLed(x, 4, 4);
      break;
   case LED_BAR_STYLE:
   case VFD_STYLE:
      setHline(x + WD + 2, x + WD + 4, 11);
      setHline(x + WD + 2, x + WD + 4, 12);
      setHline(x + WD + 2, x + WD + 4, 13);
      setHline(x + WD + 2, x + WD + 4, 19);
      setHline(x + WD + 2, x + WD + 4, 20);
      setHline(x + WD + 2, x + WD + 4, 21);
      break;
   }
}


/* renderHexDigit --- draw a single digit into the frame buffer in a given style */

void renderHexDigit(const int x, const int digit, const int style)
{
   switch (digit) {
   case 0:
      drawSegA(x, style);
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegD(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegK(x, style);
      drawSegN(x, style);
      break;
   case 1:
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegJ(x, style);
      drawSegK(x, style);
      drawSegL(x, style);
      break;
   case 2:
      drawSegA(x, style);
      drawSegB(x, style);
      drawSegD(x, style);
      drawSegE(x, style);
      drawSegG(x, style);
      drawSegI(x, style);
      drawSegL(x, style);
      drawSegM(x, style);
      break;
   case 3:
      drawSegA(x, style);
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegD(x, style);
      drawSegG(x, style);
      drawSegI(x, style);
      drawSegM(x, style);
      break;
   case 4:
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      drawSegH(x, style);  // Special segment just for 4
      drawSegI(x, style);
      drawSegJ(x, style);
      drawSegK(x, style);
      drawSegL(x, style);
      break;
   case 5:
      drawSegA(x, style);
      drawSegC(x, style);
      drawSegD(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      drawSegI(x, style);
      drawSegJ(x, style);
      drawSegM(x, style);
      break;
   case 6:
      drawSegA(x, style);
      drawSegC(x, style);
      drawSegD(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      drawSegJ(x, style);
      drawSegN(x, style);
      break;
   case 7:
      drawSegA(x, style);
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegF(x, style);  // Hooked 7
      drawSegI(x, style);
      drawSegJ(x, style);
      drawSegK(x, style);
      drawSegL(x, style);
      break;
   case 8:
      drawSegA(x, style);
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegD(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      break;
   case 9:
      drawSegA(x, style);
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegD(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      drawSegK(x, style);
      drawSegM(x, style);
      break;
   case 0xA:
      drawSegA(x, style);
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      drawSegK(x, style);
      drawSegL(x, style);
      drawSegM(x, style);
      drawSegN(x, style);
      break;
   case 0xB:
      drawSegC(x, style);     // Lowercase 'b'
      drawSegD(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      if (style == LED_DOT_STYLE) {
         drawSegA(x, style);  // Uppercase 'B'
         drawSegB(x, style);
         drawSegI(x, style);
         drawSegM(x, style);
         drawSegN(x, style);
      }
      break;
   case 0xC:
      drawSegA(x, style);
      drawSegD(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegJ(x, style);
      drawSegL(x, style);
      drawSegN(x, style);
      break;
   case 0xD:
      if (style == LED_DOT_STYLE) {
         drawSegA(x, style);  // Uppercase 'D'
         drawSegB(x, style);
         drawSegC(x, style);
         drawSegD(x, style);
         drawSegE(x, style);
         drawSegF(x, style);
         drawSegI(x, style);
         drawSegK(x, style);
         drawSegM(x, style);
         drawSegN(x, style);
      }
      else {
         drawSegB(x, style);  // Lowercase 'd'
         drawSegC(x, style);
         drawSegD(x, style);
         drawSegE(x, style);
         drawSegG(x, style);
      }
      break;
   case 0xE:
      drawSegA(x, style);
      drawSegD(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      drawSegI(x, style);
      drawSegJ(x, style);
      drawSegL(x, style);
      drawSegM(x, style);
      drawSegN(x, style);
      break;
   case 0xF:
      drawSegA(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      drawSegI(x, style);
      drawSegJ(x, style);
      drawSegM(x, style);
      drawSegN(x, style);
      break;
   }
}


/* renderClockDisplay --- draw the six clock digits into the frame buffer */

void renderClockDisplay(const int width, const int style)
{
   renderHexDigit(0 * width, Hour / 10, style);
   renderHexDigit(1 * width, Hour % 10, style);
   
   renderHexDigit(2 * width, Minute / 10, style);
   renderHexDigit(3 * width, Minute % 10, style);
   
   renderHexDigit(4 * width, Second / 10, style);
   renderHexDigit(5 * width, Second % 10, style);
}


